{"format": "graph-model", "generatedBy": "2.0.0-dev20191002", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "onet/conv6-2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv6-2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv6-3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv6-3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu5/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu4/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu3/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu2/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu1/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "48"}, {"size": "48"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv4/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv4/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv5/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "onet/conv5/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv5/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv6-1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/conv6-1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "onet/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "onet/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["onet/input", "onet/conv1/weights", "onet/conv1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "onet/prelu1/Neg", "op": "Neg", "input": ["onet/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu1/Relu", "op": "Relu", "input": ["onet/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu1/Relu_1", "op": "Relu", "input": ["onet/prelu1/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu1/Neg_1", "op": "Neg", "input": ["onet/prelu1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu1/Mul", "op": "Mul", "input": ["onet/prelu1/Neg_1", "onet/prelu1/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu1/add", "op": "AddV2", "input": ["onet/prelu1/Mul", "onet/prelu1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/pool1", "op": "MaxPool", "input": ["onet/prelu1/add"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "onet/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["onet/pool1", "onet/conv2/weights", "onet/conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "onet/prelu2/Neg", "op": "Neg", "input": ["onet/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu2/Relu", "op": "Relu", "input": ["onet/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu2/Relu_1", "op": "Relu", "input": ["onet/prelu2/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu2/Neg_1", "op": "Neg", "input": ["onet/prelu2/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu2/Mul", "op": "Mul", "input": ["onet/prelu2/Neg_1", "onet/prelu2/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu2/add", "op": "AddV2", "input": ["onet/prelu2/Mul", "onet/prelu2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/pool2", "op": "MaxPool", "input": ["onet/prelu2/add"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "onet/conv3/BiasAdd", "op": "_FusedConv2D", "input": ["onet/pool2", "onet/conv3/weights", "onet/conv3/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "onet/prelu3/Neg", "op": "Neg", "input": ["onet/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu3/Relu", "op": "Relu", "input": ["onet/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu3/Relu_1", "op": "Relu", "input": ["onet/prelu3/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu3/Neg_1", "op": "Neg", "input": ["onet/prelu3/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu3/Mul", "op": "Mul", "input": ["onet/prelu3/Neg_1", "onet/prelu3/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu3/add", "op": "AddV2", "input": ["onet/prelu3/Mul", "onet/prelu3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/pool3", "op": "MaxPool", "input": ["onet/prelu3/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "onet/conv4/BiasAdd", "op": "_FusedConv2D", "input": ["onet/pool3", "onet/conv4/weights", "onet/conv4/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "onet/prelu4/Neg", "op": "Neg", "input": ["onet/conv4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu4/Relu", "op": "Relu", "input": ["onet/conv4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu4/Relu_1", "op": "Relu", "input": ["onet/prelu4/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu4/Neg_1", "op": "Neg", "input": ["onet/prelu4/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu4/Mul", "op": "Mul", "input": ["onet/prelu4/Neg_1", "onet/prelu4/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu4/add", "op": "AddV2", "input": ["onet/prelu4/Mul", "onet/prelu4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/conv5/Reshape", "op": "Reshape", "input": ["onet/prelu4/add", "onet/conv5/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "onet/conv5/conv5/MatMul", "op": "MatMul", "input": ["onet/conv5/Reshape", "onet/conv5/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "onet/conv5/conv5", "op": "BiasAdd", "input": ["onet/conv5/conv5/MatMul", "onet/conv5/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "onet/prelu5/Neg", "op": "Neg", "input": ["onet/conv5/conv5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu5/Relu", "op": "Relu", "input": ["onet/conv5/conv5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu5/Relu_1", "op": "Relu", "input": ["onet/prelu5/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu5/Neg_1", "op": "Neg", "input": ["onet/prelu5/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu5/Mul", "op": "Mul", "input": ["onet/prelu5/Neg_1", "onet/prelu5/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/prelu5/add", "op": "AddV2", "input": ["onet/prelu5/Mul", "onet/prelu5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/conv6-2/conv6-2/MatMul", "op": "MatMul", "input": ["onet/prelu5/add", "onet/conv6-2/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "onet/conv6-3/conv6-3/MatMul", "op": "MatMul", "input": ["onet/prelu5/add", "onet/conv6-3/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "onet/conv6-1/conv6-1/MatMul", "op": "MatMul", "input": ["onet/prelu5/add", "onet/conv6-1/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "onet/conv6-2/conv6-2", "op": "BiasAdd", "input": ["onet/conv6-2/conv6-2/MatMul", "onet/conv6-2/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "onet/conv6-3/conv6-3", "op": "BiasAdd", "input": ["onet/conv6-3/conv6-3/MatMul", "onet/conv6-3/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "onet/conv6-1/conv6-1", "op": "BiasAdd", "input": ["onet/conv6-1/conv6-1/MatMul", "onet/conv6-1/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "onet/Max", "op": "Max", "input": ["onet/conv6-1/conv6-1", "onet/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "onet/sub", "op": "Sub", "input": ["onet/conv6-1/conv6-1", "onet/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/Exp", "op": "Exp", "input": ["onet/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "onet/Sum", "op": "Sum", "input": ["onet/Exp", "onet/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "onet/prob1", "op": "RealDiv", "input": ["onet/Exp", "onet/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "onet/conv6-2/weights", "shape": [256, 4], "dtype": "float32"}, {"name": "onet/conv6-2/biases", "shape": [4], "dtype": "float32"}, {"name": "onet/conv6-3/weights", "shape": [256, 10], "dtype": "float32"}, {"name": "onet/conv6-3/biases", "shape": [10], "dtype": "float32"}, {"name": "onet/prelu5/alpha", "shape": [256], "dtype": "float32"}, {"name": "onet/prelu4/alpha", "shape": [128], "dtype": "float32"}, {"name": "onet/prelu3/alpha", "shape": [64], "dtype": "float32"}, {"name": "onet/prelu2/alpha", "shape": [64], "dtype": "float32"}, {"name": "onet/prelu1/alpha", "shape": [32], "dtype": "float32"}, {"name": "onet/conv1/weights", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "onet/conv1/biases", "shape": [32], "dtype": "float32"}, {"name": "onet/conv2/weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "onet/conv2/biases", "shape": [64], "dtype": "float32"}, {"name": "onet/conv3/weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "onet/conv3/biases", "shape": [64], "dtype": "float32"}, {"name": "onet/conv4/weights", "shape": [2, 2, 64, 128], "dtype": "float32"}, {"name": "onet/conv4/biases", "shape": [128], "dtype": "float32"}, {"name": "onet/conv5/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "onet/conv5/weights", "shape": [1152, 256], "dtype": "float32"}, {"name": "onet/conv5/biases", "shape": [256], "dtype": "float32"}, {"name": "onet/conv6-1/weights", "shape": [256, 2], "dtype": "float32"}, {"name": "onet/conv6-1/biases", "shape": [2], "dtype": "float32"}, {"name": "onet/Max/reduction_indices", "shape": [], "dtype": "int32"}]}]}