{"format": "graph-model", "generatedBy": "2.0.0-dev20191002", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "rnet/conv5-2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv5-2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu4/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu3/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu2/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu1/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "24"}, {"size": "24"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv4/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnet/conv4/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv4/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv5-1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv5-1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnet/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnet/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["rnet/input", "rnet/conv1/weights", "rnet/conv1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "rnet/prelu1/Neg", "op": "Neg", "input": ["rnet/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu1/Relu", "op": "Relu", "input": ["rnet/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu1/Relu_1", "op": "Relu", "input": ["rnet/prelu1/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu1/Neg_1", "op": "Neg", "input": ["rnet/prelu1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu1/Mul", "op": "Mul", "input": ["rnet/prelu1/Neg_1", "rnet/prelu1/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu1/add", "op": "AddV2", "input": ["rnet/prelu1/Mul", "rnet/prelu1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/pool1", "op": "MaxPool", "input": ["rnet/prelu1/add"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "rnet/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["rnet/pool1", "rnet/conv2/weights", "rnet/conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "rnet/prelu2/Neg", "op": "Neg", "input": ["rnet/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu2/Relu", "op": "Relu", "input": ["rnet/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu2/Relu_1", "op": "Relu", "input": ["rnet/prelu2/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu2/Neg_1", "op": "Neg", "input": ["rnet/prelu2/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu2/Mul", "op": "Mul", "input": ["rnet/prelu2/Neg_1", "rnet/prelu2/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu2/add", "op": "AddV2", "input": ["rnet/prelu2/Mul", "rnet/prelu2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/pool2", "op": "MaxPool", "input": ["rnet/prelu2/add"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "rnet/conv3/BiasAdd", "op": "_FusedConv2D", "input": ["rnet/pool2", "rnet/conv3/weights", "rnet/conv3/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "rnet/prelu3/Neg", "op": "Neg", "input": ["rnet/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu3/Relu", "op": "Relu", "input": ["rnet/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu3/Relu_1", "op": "Relu", "input": ["rnet/prelu3/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu3/Neg_1", "op": "Neg", "input": ["rnet/prelu3/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu3/Mul", "op": "Mul", "input": ["rnet/prelu3/Neg_1", "rnet/prelu3/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu3/add", "op": "AddV2", "input": ["rnet/prelu3/Mul", "rnet/prelu3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv4/Reshape", "op": "Reshape", "input": ["rnet/prelu3/add", "rnet/conv4/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "rnet/conv4/conv4/MatMul", "op": "MatMul", "input": ["rnet/conv4/Reshape", "rnet/conv4/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "rnet/conv4/conv4", "op": "BiasAdd", "input": ["rnet/conv4/conv4/MatMul", "rnet/conv4/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "rnet/prelu4/Neg", "op": "Neg", "input": ["rnet/conv4/conv4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu4/Relu", "op": "Relu", "input": ["rnet/conv4/conv4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu4/Relu_1", "op": "Relu", "input": ["rnet/prelu4/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu4/Neg_1", "op": "Neg", "input": ["rnet/prelu4/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu4/Mul", "op": "Mul", "input": ["rnet/prelu4/Neg_1", "rnet/prelu4/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prelu4/add", "op": "AddV2", "input": ["rnet/prelu4/Mul", "rnet/prelu4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/conv5-2/conv5-2/MatMul", "op": "MatMul", "input": ["rnet/prelu4/add", "rnet/conv5-2/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "rnet/conv5-1/conv5-1/MatMul", "op": "MatMul", "input": ["rnet/prelu4/add", "rnet/conv5-1/weights"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "rnet/conv5-2/conv5-2", "op": "BiasAdd", "input": ["rnet/conv5-2/conv5-2/MatMul", "rnet/conv5-2/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "rnet/conv5-1/conv5-1", "op": "BiasAdd", "input": ["rnet/conv5-1/conv5-1/MatMul", "rnet/conv5-1/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "rnet/Max", "op": "Max", "input": ["rnet/conv5-1/conv5-1", "rnet/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnet/sub", "op": "Sub", "input": ["rnet/conv5-1/conv5-1", "rnet/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/Exp", "op": "Exp", "input": ["rnet/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnet/Sum", "op": "Sum", "input": ["rnet/Exp", "rnet/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnet/prob1", "op": "RealDiv", "input": ["rnet/Exp", "rnet/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "rnet/conv5-2/weights", "shape": [128, 4], "dtype": "float32"}, {"name": "rnet/conv5-2/biases", "shape": [4], "dtype": "float32"}, {"name": "rnet/prelu4/alpha", "shape": [128], "dtype": "float32"}, {"name": "rnet/prelu3/alpha", "shape": [64], "dtype": "float32"}, {"name": "rnet/prelu2/alpha", "shape": [48], "dtype": "float32"}, {"name": "rnet/prelu1/alpha", "shape": [28], "dtype": "float32"}, {"name": "rnet/conv1/weights", "shape": [3, 3, 3, 28], "dtype": "float32"}, {"name": "rnet/conv1/biases", "shape": [28], "dtype": "float32"}, {"name": "rnet/conv2/weights", "shape": [3, 3, 28, 48], "dtype": "float32"}, {"name": "rnet/conv2/biases", "shape": [48], "dtype": "float32"}, {"name": "rnet/conv3/weights", "shape": [2, 2, 48, 64], "dtype": "float32"}, {"name": "rnet/conv3/biases", "shape": [64], "dtype": "float32"}, {"name": "rnet/conv4/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "rnet/conv4/weights", "shape": [576, 128], "dtype": "float32"}, {"name": "rnet/conv4/biases", "shape": [128], "dtype": "float32"}, {"name": "rnet/conv5-1/weights", "shape": [128, 2], "dtype": "float32"}, {"name": "rnet/conv5-1/biases", "shape": [2], "dtype": "float32"}, {"name": "rnet/Max/reduction_indices", "shape": [], "dtype": "int32"}]}]}