{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "inception_resnet_v1", "layers": [{"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "Conv2d_1a_3x3", "class_name": "Conv2D", "config": {"name": "Conv2d_1a_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "Conv2d_1a_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Conv2d_1a_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_1a_3x3", 0, 0, {}]]]}, {"name": "Conv2d_1a_3x3_Activation", "class_name": "Activation", "config": {"name": "Conv2d_1a_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_1a_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Conv2d_2a_3x3", "class_name": "Conv2D", "config": {"name": "Conv2d_2a_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_1a_3x3_Activation", 0, 0, {}]]]}, {"name": "Conv2d_2a_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Conv2d_2a_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_2a_3x3", 0, 0, {}]]]}, {"name": "Conv2d_2a_3x3_Activation", "class_name": "Activation", "config": {"name": "Conv2d_2a_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_2a_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Conv2d_2b_3x3", "class_name": "Conv2D", "config": {"name": "Conv2d_2b_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_2a_3x3_Activation", 0, 0, {}]]]}, {"name": "Conv2d_2b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Conv2d_2b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_2b_3x3", 0, 0, {}]]]}, {"name": "Conv2d_2b_3x3_Activation", "class_name": "Activation", "config": {"name": "Conv2d_2b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_2b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "MaxPool_3a_3x3", "class_name": "MaxPooling2D", "config": {"name": "MaxPool_3a_3x3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv2d_2b_3x3_Activation", 0, 0, {}]]]}, {"name": "Conv2d_3b_1x1", "class_name": "Conv2D", "config": {"name": "Conv2d_3b_1x1", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]]}, {"name": "Conv2d_3b_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Conv2d_3b_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_3b_1x1", 0, 0, {}]]]}, {"name": "Conv2d_3b_1x1_Activation", "class_name": "Activation", "config": {"name": "Conv2d_3b_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_3b_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Conv2d_4a_3x3", "class_name": "Conv2D", "config": {"name": "Conv2d_4a_3x3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_3b_1x1_Activation", 0, 0, {}]]]}, {"name": "Conv2d_4a_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Conv2d_4a_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_4a_3x3", 0, 0, {}]]]}, {"name": "Conv2d_4a_3x3_Activation", "class_name": "Activation", "config": {"name": "Conv2d_4a_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_4a_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Conv2d_4b_3x3", "class_name": "Conv2D", "config": {"name": "Conv2d_4b_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_4a_3x3_Activation", 0, 0, {}]]]}, {"name": "Conv2d_4b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Conv2d_4b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_4b_3x3", 0, 0, {}]]]}, {"name": "Conv2d_4b_3x3_Activation", "class_name": "Activation", "config": {"name": "Conv2d_4b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_4b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3", "class_name": "Conv2D", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]]}, {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Branch_1_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Branch_0_Conv2d_1x1", "class_name": "Conv2D", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3", "class_name": "Conv2D", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3", "class_name": "Conv2D", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1", 0, 0, {}]]]}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]]}, {"name": "Block35_1_Branch_0_Conv2d_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Branch_0_Conv2d_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Branch_1_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_1_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Branch_2_Conv2d_0c_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_1_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_1_Concatenate", "class_name": "Concatenate", "config": {"name": "Block35_1_Concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Block35_1_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_1_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_1_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_1_Conv2d_1x1", "class_name": "Conv2D", "config": {"name": "Block35_1_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Concatenate", 0, 0, {}]]]}, {"name": "lambda_51", "class_name": "Lambda017", "config": {"name": "lambda_51", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwgAAAB8AHwBFABTACkBTqkAKQLaAXjaBXNjYWxlcgEAAABy\nAQAAAPpSQzpcVXNlcnNcMVxEZXNrdG9wXHRlbnNvcmZsb3dca2VyYXMtZmFjZW5ldC1tYXN0ZXJc\nbm90ZWJvb2tcaW5jZXB0aW9uX3Jlc25ldF92MS5wedoHc2NhbGluZxkAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "output_shape": [17, 17, 256], "output_shape_type": "raw", "arguments": {"scale": 0.17}}, "inbound_nodes": [[["Block35_1_Conv2d_1x1", 0, 0, {}]]]}, {"name": "add_43", "class_name": "Add", "config": {"name": "add_43", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Conv2d_4b_3x3_Activation", 0, 0, {}], ["lambda_51", 0, 0, {}]]]}, {"name": "Block35_1_Activation", "class_name": "Activation", "config": {"name": "Block35_1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_43", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3", "class_name": "Conv2D", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]]}, {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Branch_1_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_2_Branch_0_Conv2d_1x1", "class_name": "Conv2D", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3", "class_name": "Conv2D", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3", "class_name": "Conv2D", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1", 0, 0, {}]]]}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]]}, {"name": "Block35_2_Branch_0_Conv2d_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Branch_0_Conv2d_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Branch_1_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_2_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Branch_2_Conv2d_0c_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_2_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_2_Concatenate", "class_name": "Concatenate", "config": {"name": "Block35_2_Concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Block35_2_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_2_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_2_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_2_Conv2d_1x1", "class_name": "Conv2D", "config": {"name": "Block35_2_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Concatenate", 0, 0, {}]]]}, {"name": "lambda_52", "class_name": "Lambda017", "config": {"name": "lambda_52", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwgAAAB8AHwBFABTACkBTqkAKQLaAXjaBXNjYWxlcgEAAABy\nAQAAAPpSQzpcVXNlcnNcMVxEZXNrdG9wXHRlbnNvcmZsb3dca2VyYXMtZmFjZW5ldC1tYXN0ZXJc\nbm90ZWJvb2tcaW5jZXB0aW9uX3Jlc25ldF92MS5wedoHc2NhbGluZxkAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "output_shape": [17, 17, 256], "output_shape_type": "raw", "arguments": {"scale": 0.17}}, "inbound_nodes": [[["Block35_2_Conv2d_1x1", 0, 0, {}]]]}, {"name": "add_44", "class_name": "Add", "config": {"name": "add_44", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Block35_1_Activation", 0, 0, {}], ["lambda_52", 0, 0, {}]]]}, {"name": "Block35_2_Activation", "class_name": "Activation", "config": {"name": "Block35_2_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_44", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3", "class_name": "Conv2D", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3", 0, 0, {}]]]}, {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Branch_1_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_3_Branch_0_Conv2d_1x1", "class_name": "Conv2D", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3", "class_name": "Conv2D", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0a_1x1_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3", "class_name": "Conv2D", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0b_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1", 0, 0, {}]]]}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0b_3x3", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0c_3x3", 0, 0, {}]]]}, {"name": "Block35_3_Branch_0_Conv2d_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Branch_0_Conv2d_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Branch_1_Conv2d_0b_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_3_Branch_1_Conv2d_0b_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Branch_2_Conv2d_0c_3x3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_3_Branch_2_Conv2d_0c_3x3_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_3_Concatenate", "class_name": "Concatenate", "config": {"name": "Block35_3_Concatenate", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Block35_3_Branch_0_Conv2d_1x1_Activation", 0, 0, {}], ["Block35_3_Branch_1_Conv2d_0b_3x3_Activation", 0, 0, {}], ["Block35_3_Branch_2_Conv2d_0c_3x3_Activation", 0, 0, {}]]]}, {"name": "Block35_3_Conv2d_1x1", "class_name": "Conv2D", "config": {"name": "Block35_3_Conv2d_1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_3_Concatenate", 0, 0, {}]]]}, {"name": "lambda_53", "class_name": "Lambda017", "config": {"name": "lambda_53", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwgAAAB8AHwBFABTACkBTqkAKQLaAXjaBXNjYWxlcgEAAABy\nAQAAAPpSQzpcVXNlcnNcMVxEZXNrdG9wXHRlbnNvcmZsb3dca2VyYXMtZmFjZW5ldC1tYXN0ZXJc\nbm90ZWJvb2tcaW5jZXB0aW9uX3Jlc25ldF92MS5wedoHc2NhbGluZxkAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "output_shape": [17, 17, 256], "output_shape_type": "raw", "arguments": {"scale": 0.17}}, "inbound_nodes": [[["Block35_3_Conv2d_1x1", 0, 0, {}]]]}, {"name": "add_45", "class_name": "Add", "config": {"name": "add_45", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Block35_2_Activation", 0, 0, {}], ["lambda_53", 0, 0, {}]]]}, {"name": "Block35_3_Activation", "class_name": "Activation", "config": {"name": "Block35_3_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_45", 0, 0, {}]]]}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_4_Branch_2_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Block35_3_Activation", 0, 0, {}]]]}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm", "class_name": "BatchNormalization", "config": {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.995, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Block35_4_Branch_2_Conv2d_0a_1x1", 0, 0, {}]]]}, {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_Activation", "class_name": "Activation", "config": {"name": "Block35_4_Branch_2_Conv2d_0a_1x1_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Block35_4_Branch_2_Conv2d_0a_1x1_BatchNorm", 0, 0, {}]]]}, {"name": "Block35_4_Branch_1_Conv2d_0a_1x1", "class_name": "Conv2D", "config": {"name": "Block35_4_Branch_1_Conv2d_0a_1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, 