{"format": "graph-model", "generatedBy": "2.0.0-dev20191002", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "pnet/conv4-2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv4-2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU3/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU2/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU1/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "10"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv3/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv4-1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv4-1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pnet/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pnet/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["pnet/input", "pnet/conv1/weights", "pnet/conv1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "pnet/PReLU1/Neg", "op": "Neg", "input": ["pnet/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU1/Relu", "op": "Relu", "input": ["pnet/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU1/Relu_1", "op": "Relu", "input": ["pnet/PReLU1/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU1/Neg_1", "op": "Neg", "input": ["pnet/PReLU1/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU1/Mul", "op": "Mul", "input": ["pnet/PReLU1/Neg_1", "pnet/PReLU1/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU1/add", "op": "AddV2", "input": ["pnet/PReLU1/Mul", "pnet/PReLU1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/pool1", "op": "MaxPool", "input": ["pnet/PReLU1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "pnet/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["pnet/pool1", "pnet/conv2/weights", "pnet/conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "pnet/PReLU2/Neg", "op": "Neg", "input": ["pnet/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU2/Relu", "op": "Relu", "input": ["pnet/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU2/Relu_1", "op": "Relu", "input": ["pnet/PReLU2/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU2/Neg_1", "op": "Neg", "input": ["pnet/PReLU2/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU2/Mul", "op": "Mul", "input": ["pnet/PReLU2/Neg_1", "pnet/PReLU2/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU2/add", "op": "AddV2", "input": ["pnet/PReLU2/Mul", "pnet/PReLU2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv3/BiasAdd", "op": "_FusedConv2D", "input": ["pnet/PReLU2/add", "pnet/conv3/weights", "pnet/conv3/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "pnet/PReLU3/Neg", "op": "Neg", "input": ["pnet/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU3/Relu", "op": "Relu", "input": ["pnet/conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU3/Relu_1", "op": "Relu", "input": ["pnet/PReLU3/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU3/Neg_1", "op": "Neg", "input": ["pnet/PReLU3/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU3/Mul", "op": "Mul", "input": ["pnet/PReLU3/Neg_1", "pnet/PReLU3/alpha"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/PReLU3/add", "op": "AddV2", "input": ["pnet/PReLU3/Mul", "pnet/PReLU3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/conv4-2/BiasAdd", "op": "_FusedConv2D", "input": ["pnet/PReLU3/add", "pnet/conv4-2/weights", "pnet/conv4-2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "pnet/conv4-1/BiasAdd", "op": "_FusedConv2D", "input": ["pnet/PReLU3/add", "pnet/conv4-1/weights", "pnet/conv4-1/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "pnet/Max", "op": "Max", "input": ["pnet/conv4-1/BiasAdd", "pnet/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "pnet/sub", "op": "Sub", "input": ["pnet/conv4-1/BiasAdd", "pnet/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/Exp", "op": "Exp", "input": ["pnet/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pnet/Sum", "op": "Sum", "input": ["pnet/Exp", "pnet/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "pnet/prob1", "op": "RealDiv", "input": ["pnet/Exp", "pnet/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "pnet/conv4-2/weights", "shape": [1, 1, 32, 4], "dtype": "float32"}, {"name": "pnet/conv4-2/biases", "shape": [4], "dtype": "float32"}, {"name": "pnet/PReLU3/alpha", "shape": [32], "dtype": "float32"}, {"name": "pnet/PReLU2/alpha", "shape": [16], "dtype": "float32"}, {"name": "pnet/PReLU1/alpha", "shape": [10], "dtype": "float32"}, {"name": "pnet/conv1/weights", "shape": [3, 3, 3, 10], "dtype": "float32"}, {"name": "pnet/conv1/biases", "shape": [10], "dtype": "float32"}, {"name": "pnet/conv2/weights", "shape": [3, 3, 10, 16], "dtype": "float32"}, {"name": "pnet/conv2/biases", "shape": [16], "dtype": "float32"}, {"name": "pnet/conv3/weights", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "pnet/conv3/biases", "shape": [32], "dtype": "float32"}, {"name": "pnet/conv4-1/weights", "shape": [1, 1, 32, 2], "dtype": "float32"}, {"name": "pnet/conv4-1/biases", "shape": [2], "dtype": "float32"}, {"name": "pnet/Max/reduction_indices", "shape": [], "dtype": "int32"}]}]}